<?php
return [
    'title'                     => 'จัดการธุรกิจ: {0}',
    'subtitle'                  => [
        'generic-information' => 'ข้อมูลทั่วไป',
        'tax-information'     => 'ข้อมูลด้านภาษี',
        'mart-decoration'     => 'การตกแต่งมาร์เก็ตเพลสของคุณ',
        'mart-seo'            => 'ข้อมูลส่งเสริม SEO ของคุณ',
    ],
    'btn-update-slug'           => 'อัปเดทรหัสธุรกิจ',
    'btn-update-slug-confirm'   => 'ยืนยันอัปเดทรหัสธุรกิจ',
    'marketplace-url'           => 'URL ของมาร์เก็ตเพลสของคุณคือ <a href="{0}" target="_blank">{0}</a> หากมีการเปลี่ยนแปลง URL ของคุณจะถูกแก้ไขหลังจากคุณกด “บันทึก” ด้านล่างแล้วเท่านั้น',
    'logo'                      => 'โลโก้',
    'upload-logo'               => 'อัปโหลดโลโก้ของธุรกิจ',
    'upload-explanation'        => 'ระบบรองรับไฟล์ประเภท <code>png</code> และ <code>jpg</code> ที่มีขนาดต่ำกว่า 600kb เท่านั้น และถ้ารูปใหญ่กว่า (กว้าง) 500px (สูง) 500px ระบบจะทำการตัดส่วนเกิดออกให้โดยอัตโนมัติ',
    'business-header'           => 'เฮดเดอร์แบนเนอร์',
    'upload-header-img'         => 'อัปโหลดเฮดเดอร์แบนเนอร์',
    'upload-explanation-header' => 'ระบบรองรับไฟล์ประเภท <code>png</code> และ <code>jpg</code> ที่มีขนาดต่ำกว่า 1000kb เท่านั้น และถ้ารูปใหญ่กว่า (กว้าง) 1200px (สูง) 800px ระบบจะทำการตัดส่วนเกิดออกให้โดยอัตโนมัติ',
    'marketplace'               => 'มาร์เก็ตเพลส',
    'marketplace-example-text'  => 'นี่คือตัวอย่างของข้อความที่จะแสดงบนเว็บไซต์มาร์เก็ตเพลสของคุณ',
    'clear-cache'               => 'ข้อมูลของคุณที่อัปเดทใหม่จะแสดงบนหน้ามาร์เก็ตเพลสภายในหนึ่งชั่วโมง หากคุณต้องการอัปเดทตอนนี้ กรุณากดที่ปุ่มด้านล่าง',
    'btn-clear-cache'           => 'อัปเดทข้อมูลตอนนี้',
    'contracts'                 => 'สัญญา',
    'contract-renew'            => 'ต่อสัญญา',
    'payment-records'           => 'รายการค่าใช้จ่าย',
    'packages'                  => [
        'pick-one' => 'กรุณาเลือกแพ็กเกจสำหรับการต่ออายุ',
        'validity' => [
            'month' => 'รายเดือน',
            'year'  => 'รายปี',
        ]
    ],
    'has-unpaid-contract'       => 'คุณมีสัญญาที่ยังไม่ได้ชำระ กรุณาชำระเงิน',
    'renewal'                   => [
        'amount-due'         => 'จำนวนที่ต้องชำระ',
        'payments'           => 'รายการการชำระเงิน',
        'payment-at'         => 'บันทึกเมื่อ',
        'how-to-pay'         => 'วิธีการชำระเงิน',
        'pay-by-credit-card' => 'ชำระโดยบัตรเครดิต',
        'pay-by-qr-thailand' => 'ชำระโดยการสแกน QR (พร้อมเพย์)',
    ],
    'branch-management'         => [
        'new-branch'           => 'สาขาใหม่',
        'generic-title'        => 'ข้อมูลสาขาเปิดใหม่',
        'generic-information'  => 'ข้อมูลทั่วไป',
        'opening-hours'        => 'เวลาเปิดทำการ',
        'modified-hours'       => 'การเปลี่ยนแปลงเวลาเปิดทำการ',
        'modified-hours-new'   => 'เพิ่มวันที่มีการเปลี่ยนแปลง',
        'hours'                => [
            'day'    => 'วัน',
            'opens'  => 'เวลาเปิด',
            'closes' => 'เวลาปิด',
        ],
        'days'                 => [
            'M'  => 'วันจันทร์',
            'T'  => 'วันอังคาร',
            'W'  => 'วันพุธ',
            'TH' => 'วันพฤหัสบดี',
            'F'  => 'วันศุกร์',
            'S'  => 'วันเสาร์',
            'SU' => 'วันอาทิตย์',
        ],
        'close-shop'           => 'ปิดร้าน',
        'staff-in-this-branch' => 'พนักงานในสาขานี้',
        'go-to-user-to-manage' => 'กรุณาไปยังหน้า<a href="{0}">พนักงาน</a>เพื่อแก้ไขรายชื่อพนักงานในสาขานี้'
    ],
    'user-management'           => [
        'new-user'           => 'พนักงานใหม่',
        'new-user-info'      => 'ข้อมูลพนักงานใหม่',
        'generic-info'       => 'ข้อมูลทั่วไป',
        'link-to-business'   => 'สถานะของผู้ใช้ในธุรกิจ',
        'link-to-branches'   => 'สถานะของผู้ใช้ในสาขา',
        'no-branches'        => 'ไม่มีรายการสาขาของพนักงาน กรุณาเพิ่มสาขา',
        'link-to-new-branch' => 'เพิ่มสาขาของพนักงาน'
    ],
    'customer-management'       => [
        'privacy-policy' => 'ข้อมูลลูกค้าเป็นข้อมูลส่วนบุคคล ลูกค้ามีสิทธิที่จะแก้ไขหรือลบข้อมูลได้ทุกเมื่อ',
    ],
    'resource-management'       => [
        'new-resource'            => 'ทรัพยากรใหม่',
        'new-resource-type'       => 'ประเภททรัพยากรใหม่',
        'add-resource-type-first' => 'กรุณาสร้างประเภททรัพยากรก่อนเพิ่มทรัพยากร'
    ],
    'shipping-rate'             => [
        'add-new'             => 'เพิ่มเรทค่าจัดส่ง',
        'max-price-error'     => 'มูลค่าสูงสุดของช่วงราคาต้องมีค่ามากกว่ามูลค่าต่ำสุด',
        'shipping-rate-error' => 'ค่าจัดส่งต้องเป็นตัวเลข และมีค่าเป็นบวกเท่านั้น'
    ]
];