<?php
return [
    'field'       => [
        'id'                         => 'ไอดี',
        'business_type_id'           => 'ประเภทธุรกิจ',
        'business_name'              => 'ชื่อธุรกิจ',
        'business_slug'              => 'รหัสธุรกิจ',
        'business_local_names'       => 'ชื่อธุรกิจในภาษาอื่น',
        'country_code'               => 'ประเทศ',
        'currency_code'              => 'สกุลเงิน',
        'tax_percentage'             => 'อัตราภาษี',
        'tax_inclusive'              => 'การคิดภาษี (VAT)',
        'mart_primary_color'         => 'สีหลักของมาร์เก็ตเพลส',
        'mart_text_color'            => 'สีข้อความของมาร์เก็ตเพลส',
        'mart_background_color'      => 'สีพื้นหลังของมาร์เก็ตเพลส',
        'mart_meta_description'      => 'คำอธิบายธุรกิจ (สำหรับ SEO)',
        'mart_meta_keywords'         => 'คำค้นหา/คีย์เวิร์ด (สำหรับ SEO)',
        'mart_store_intro_paragraph' => 'คำอธิบายธุรกิจ (บนหน้าเว็บ)',
        'social_media'               => 'สื่อสังคม',
        'contract_plan'              => 'แผน',
        'contract_expiry'            => 'วันหมดอายุสัญญา',
        'business_status'            => 'สถานะธุรกิจ', // Not a real field
        'allow_advance_booking'      => 'จำนวนวันที่อนุญาตให้จองล่วงหน้าได้ (สำหรับบริการจองล่วงหน้าเท่านั้น)',
        'contact'                    => 'ข้อมูลติดต่อ',
        'contact_email_address'      => 'อีเมล',
        'contact_phone_number'       => 'หมายเลขโทรศัพท์',
        'contact_website'            => 'เว็บไซต์',
        'live_status'                => 'สถานะของร้านออนไลน์',
        'shipping'                   => 'การจัดส่งสินค้า (ถ้ามี)',
        'shipping_options'           => 'ตัวเลือกการจัดส่ง',
        'shipping_fee_taxable'       => 'การคิดภาษีค่าจัดส่งสินค้า',
        'review_stars'               => 'รีวิว',
    ],
    'enum'        => [
        'tax_inclusive'        => [
            'I' => 'รวมในราคา',
            'E' => 'ไม่รวมในราคา',
            'X' => 'ไม่ต้องคิดภาษี'
        ],
        'business_status'      => [
            'A' => '<i class="fa-solid fa-circle-check text-success"></i> ปกติ',
            'E' => '<i class="fa-solid fa-circle-xmark text-danger"></i> หมดอายุ',
        ],
        'live_status'          => [
            'Y' => 'ออนไลน์',
            'N' => 'ปิด'
        ],
        'shipping_options'     => [
            'SHIPPING'        => 'จัดส่งสินค้าผ่านไปรษณีย์',
            'SELF-COLLECTION' => 'รับสินค้าด้วยตนเองที่สาขา',
            'BOTH'            => 'ทั้งคู่'
        ],
        'shipping_fee_taxable' => [
            'Y' => 'ต้องคำนวณภาษี',
            'N' => 'ไม่นำมาคำนวณ'
        ],
        'contract_plan'        => [
            'free'     => 'ฟรี',
            'basic'    => 'เบสิก',
            'standard' => 'สแตนดาร์ด',
            'premium'  => 'พรีเมียม',
        ]
    ],
    'explanation' => [
        'business_name'         => 'เมื่อคุณกดปุ่ม “อัปเดทรหัสธุรกิจ” ด้านล่าง ระบบจะทำการสร้างรหัสธุรกิจใหม่จากชื่อธุรกิจของคุณ รหัสธุรกิจนี้จะถูกใช้ในการสร้าง URL ไปยังหน้ามาร์เก็ตเพลสของคุณ<br><b class="text-danger"><i class="fa-solid fa-exclamation-triangle"></i> คำเตือน!</b> URL สำหรับมาร์เก็ตเพลสของคุณจะถูกเปลี่ยนทันทีเมื่อคุณบันทึกการเปลี่ยนแปลงหน้านี้ กรุณาปรับแก้ URL ตามเอกสารหรือหน้าเว็บต่างๆ ที่คุณลงไว้',
        'tax_inclusive'         => 'ตั้งค่าวิธีคิดภาษี:<br />- <b>รวมในราคา</b> (มีภาษีอยู่ในราคาที่กำหนดแล้ว),<br />- <b>ไม่รวมในราคา</b> (บวกภาษีเพิ่มจากราคา),<br />- <b>ไม่ต้องคิดภาษี</b> (ธุรกิจไม่มีความจำเป็นต้องเสียภาษี)',
        'currency_code'         => 'ไม่สามารถเปลี่ยนสกุลเงินได้หากสถานะของธุรกิจเป็น <b>ออนไลน์</b><br /><b class="text-danger"><i class="fa-solid fa-exclamation-triangle"></i> คำเตือน!</b> ข้อควรระวังสำหรับการเปลี่ยนสกุลเงิน คือราคาที่ตั้งไว้จะไม่ได้รับการเปลี่ยนด้วย หากสินค้าหรือบริการถูกตั้งราคาไว้ที่ 100 บาท และเปลี่ยนสกุลเงินเป็น USD ราคาจะถูกเปลี่ยนเป็น 100 ดอลลาร์โดยอัตโนมัติ',
        'mart_meta_description' => 'นี่คือข้อความสั้นๆ 20-40 คำสำหรับอธิบายธุรกิจของคุณ ซึ่งจะไม่แสดงบนหน้าจอ',
        'mart_meta_keywords'    => 'นี่คือกลุ่มคำที่ลูกค้าอาจจะใช้ค้นหาธุรกิจของคุณ เป็นคีย์เวิร์ดที่อธิบายธุรกิจที่คุณกำลังทำอยู่',
        'live_status'           => 'สถานะนี้บ่งชี้สถานะของร้านในมาร์เก็ตเพลส ว่าสามารถค้นหาและ/หรือเข้าชมได้จากเว็บมาร์เก็ตเพลสหรือไม่'
    ]
];