<?php
return [
    'you-are-on-free-plan' => 'ธุรกิจของคุณอยู่ในแผนฟรี',
    'upgrade-options'      => 'ทางเลือกในการอัปเกรด:',
    'table'                => [
        'features'            => 'ฟีเจอร์',
        'monthly-plan'        => 'แผนรายเดือน',
        'annual-plan'         => 'แผนรายปี',
        'you-are-here'        => 'คุณใช้แผนนี้อยู่',
        'you-save'            => 'คุณประหยัดได้ {0}%<br/>เมื่อจ่ายแบบรายปี',
        'upgrade-to-basic'    => 'อัปเกรดไปแผน เบสิก',
        'upgrade-to-standard' => 'อัปเกรดไปแผน สแตนดาร์ด',
        'upgrade-to-premium'  => 'อัปเกรดไปแผน พรีเมียม',
        'user_accounts'       => 'บัญชีผู้ใช้ (พนักงาน)',
        'services'            => 'จำนวนบริการ',
        'products'            => 'จำนวนสินค้า',
        'variants'            => 'ตัวเลือกย่อยต่อบริการ/สินค้า (Variants)',
        'images'              => 'รูปภาพต่อบริการ/สินค้า',
        'branches'            => 'จำนวนสาขา',
        'timeslots'           => 'การจองบริการแบบเลือกช่วงเวลา (Timeslot)',
        'sessions'            => 'การจองบริการแบบเลือกคอร์ส/เซสชัน (Session)',
        'about-us'            => 'หน้าเว็บที่กำหนดเองได้ (หน้าเกี่ยวกับเรา)',
    ]
];