<?php
return [
    'error' => [
        'adding-item'          => 'เกิดข้อผิดพลาดระหว่างใส่ {1} ในตะกร้า กรุณาลองใหม่อีกครั้งหรือติดต่อเรา',
        'product-out-of-stock' => 'สินค้า {1} หมดแล้ว',
        'start-in-the-past'    => 'ขออภัย เซสชั่นของคุณได้เริ่มขึ้นแล้ว กรุณาเลือกเวลาใหม่',
        'staff-conflict'       => 'ขออภัย พนักงานที่คุณเลือกไม่ว่างแล้ว กรุณาเลือกเวลาใหม่',
        'resource-conflict'    => 'ขออภัย เซสชั่นตามเวลาที่คุณเลือกไม่ว่างแล้ว กรุณาเลือกเวลาใหม่',
        'session-unavailable'  => 'ขออภัย เซสชั่นที่คุณเลือกไม่ว่างแล้ว กรุณาเลือกเซสชั่นใหม่',
        'session-full'         => 'ขออภัย เซสชั่นที่คุณเลือกเต็มแล้ว กรุณาเลือกเซสชั่นใหม่',
    ]
];