<?php
return [
    'field' => [
        'id'                        => 'ไอดี',
        'service_id'                => 'บริการ',
        'variant_slug'              => 'รหัสตัวเลือกบริการ',
        'variant_name'              => 'ชื่อตัวเลือก',
        'variant_local_names'       => 'ชื่อตัวเลือกในภาษาต่างๆ',
        'is_active'                 => 'สถานะ',
        'schedule_type'             => 'ประเภทการนัดหมาย (ข้อมูลนี้หลังจากตั้งค่าแล้วจะแก้ไขไม่ได้)',
        'variant_capacity'          => 'จำนวนลูกค้าที่รับได้',
        'price_active'              => 'ราคา',
        'price_compare'             => 'ราคาเปรียบเทียบ',
        'required_num_staff'        => 'จำนวนพนักงานที่ใช้ (ข้อมูลนี้หลังจากตั้งค่าแล้วจะแก้ไขไม่ได้)',
        'required_resource_type_id' => 'ประเภทของทรัพยากรที่ต้องใช้ (ข้อมูลนี้หลังจากตั้งค่าแล้วจะแก้ไขไม่ได้)',
        'service_duration_minutes'  => 'ระยะเวลา (นาที) (ข้อมูลนี้หลังจากตั้งค่าแล้วจะแก้ไขไม่ได้)',
    ],
    'enum'  => [
        'is_active'     => [
            'A' => 'ปกติ',
            'I' => 'สินค้าหมด',
        ],
        'schedule_type' => [
            'A' => 'เลือกเวลาเอง',
            'S' => 'มีกำหนดตารางเวลา',
        ],
    ]
];