<?php
return [
    'new-service'        => 'บริการใหม่',
    'service-variant'    => 'ตัวเลือกบริการ',
    'new-variant'        => 'ตัวเลือกใหม่',
    'service-staff'      => 'พนักงานที่ให้บริการนี้',
    'num-staff'          => '{0} คน',
    'duration-minutes'   => '{0} นาที',
    'duration-hours'     => '{0} ชั่วโมง',
    'duration-hm'        => '{0} ชั่วโมง {1} นาที',
    'add-service-staff'  => 'เพิ่มพนักงานที่ให้บริการนี้',
    'upload-image'       => 'อัปโหลดรูปบริการ',
    'upload-explanation' => 'ระบบรองรับไฟล์ประเภท <code>png</code> และ <code>jpg</code> ที่มีขนาดต่ำกว่า 800kb เท่านั้น และถ้ารูปใหญ่กว่า (กว้าง) 1280px (สูง) 960px ระบบจะทำการตัดส่วนเกิดออกให้โดยอัตโนมัติ',
    'session'            => [
        'view-btn'    => 'ดูเซสชั่น',
        'title'       => 'เซสชั่น',
        'new-session' => 'เซสชั่นใหม่',
        'explanation' => 'หน้านี้มีไว้สำหรับสร้างเซสชั่นที่เปิดให้ใครก็ได้สมัครเข้าร่วม อาจเป็นเซสชั่นที่แบ่งเป็นหลายรอบ (เช่น คอร์สภาษา 10 ครั้ง ครั้งละ 2 ชั่วโมง) หรือเซสชั่นวันเดียวจบ (เช่น คอร์สทำอาหาร 90 นาที)'
    ]
];